{"keras_version": "2.1.4", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "batch_input_shape": [null, 30, 30, 1], "filters": 30, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "dtype": "float32", "name": "conv2d_1", "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 30, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "name": "conv2d_2", "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 30, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "name": "conv2d_3", "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 30, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "data_format": "channels_last", "name": "conv2d_4", "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.2, "name": "dropout_1", "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 1000, "trainable": true, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 500, "trainable": true, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 200, "trainable": true, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 100, "trainable": true, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 50, "trainable": true, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_5", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 12, "trainable": true, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_6", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}], "backend": "tensorflow"}